Repository: 84000/data-translation-memory
Catalog: Toh_134-The_Absorption_That_Encapsulates_All_Merit-v2.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་རྣམ་གྲངས་དེས་ཀྱང་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྐྱོན་ཡང་མེད་ལ། སྐྱོན་མེད་པ་ལ་ཡང་འཇུག་པར་མི་བྱེད་པ་དེ་ལྟར་རིག་པར་བྱའོ། །
en: Son of noble family, you should understand through this description the way in which bodhisattvas are free of faults, and yet do not enter faultlessness.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་རྨད་དུ་བྱུང་བའི་ཆོས་དེ་ལ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་མ་མཆིས་པ་ནི་ངོ་མཚར་ལགས་སོ། །
en: “Blessed One, this marvelous doctrine of the bodhisattva great beings is not to be found among the śrāvakas and solitary buddhas; how wonderful!”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་གོ། །
en: On this occasion, since Mañjuśrī­kumāra­bhūta was present in the gathering,

source: བཅོམ་ལྡན་འདས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འདི་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདིའི་སྐབས་སུ་བཀའ་མཆིད་ཀྱི་རྒྱུད་ཅི་ཡང་མི་མཆི་ལགས་སོ། །
en: “Blessed One, on this occasion of the absorption that encapsulates all merit, Mañjuśrī­kumāra­bhūta has not presented a talk.”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྲེད་མེད་ཀྱི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Mañjuśrī­kumāra­bhūta then said to the bodhisattva great being Nārāyaṇa,

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བསོད་ནམས་འདོད་པའི་ཕྱིར་བྱང་ཆུབ་ཏུ་སྤྱོད་པར་མི་བྱེད་དོ། །
en: “Son of noble family, bodhisattvas do not carry out the practices toward awakening out of a desire for merit.

source: རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་འདོད་པ་དང་། མཐོ་རིས་འདོད་པ་དང་། ལོངས་སྤྱོད་འདོད་པ་དང་། འཁོར་འདོད་པ་དང་། གྲགས་པ་དང་། སྙན་པ་དང་། བསྔགས་པ་འདོད་པའི་ཕྱིར་བྱང་ཆུབ་ཏུ་སྤྱོད་པར་མི་བྱེད་དོ། །
en: They do not carry out the practices toward awakening out of a desire for gain, praise, or eulogy, nor for the higher states, wealth, followers, fame, renown, or honor.”

source: འཇམ་དཔལ་འོ་ན་ཅིའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བྱང་ཆུབ་ཏུ་སྤྱོད་པར་བྱེད།
en: “So, Mañjuśrī, why do bodhisattvas carry out the practices toward awakening?”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ།
en: Mañjuśrī answered,

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་བའི་ཕྱིར་བྱང་ཆུབ་ཏུ་སྤྱོད་པར་བྱེད་དོ། །
en: “Son of noble family, bodhisattvas carry out the practices toward awakening out of compassion for all beings.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཆོས་འདོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་བསལ་བར་འདོད་པ་དང་། ཡང་དག་པ་མ་ཡིན་པའི་ཉོན་མོངས་པ་རབ་ཏུ་ཞི་བར་འདོད་པ་དང་། བདག་གི་སྡུག་བསྔལ་དང་འདྲ་བར་འདོད་པ་དང་། ལན་དུ་ཕན་འདོགས་པ་མི་འདོད་པའི་ཕྱིར་བྱང་ཆུབ་ཏུ་སྤྱོད་པར་བྱེད་དོ། །
en: Bodhisattvas carry out the practices toward awakening out of their longing for the Dharma, their wish to eliminate all beings’ suffering, their wish to eradicate the mistaken afflictions, and their wish to experience a similar suffering themselves; they do not carry out these practices out of a wish for gratitude.

source: རིགས་ཀྱི་བུ་དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ལུས་དང་སེམས་ལ་མི་ལྟ་བ་དང་། ཡོངས་སུ་འཛིན་པ་མེད་པ་དང་། མི་འཕྲོགས་པ་དང་། ལྷག་པར་ཞེན་པ་མེད་པ་དང་། མཚན་མ་མེད་པ་དང་། ཡིད་ལ་བྱེད་པ་མེད་པ་དང་།
en: Therefore, son of noble family, bodhisattvas carry out the practices toward awakening without regard for body or mind, without any clinging, in an unflagging manner without fixation, concepts, or mental engagement.

source: མི་ལྡོག་པ་དང་། མི་ལྡོག་པའི་ཆོས་ཅན་དང་། ཡང་དག་པར་རྟོག་པར་མི་བྱེད་པ་དང་། བསྐྱོད་དུ་མེད་པ་དང་། རྗེས་སུ་ཆགས་པ་མེད་པ་དང་། ཁོང་ཁྲོ་བ་མེད་པ་དང་།
en: They are undeterred and cannot be stopped, nonconceptual, steadfast, and without attachment or anger.

source: གཅིག་ཏུ་དཔའ་བ་དང་། ཐུབ་པ་མེད་པ་དང་། གོང་བ་མེད་པ་དང་། མི་སྐྲག་པ་དང་། མི་འཇིགས་པ་དང་། ཀུན་ཏུ་རབ་ཏུ་མི་འཇིགས་པ་དང་། མ་ཁེངས་པ་དང་། མ་དུད་པ་དང་། བརྟན་པ་དང་། མི་གཡོ་བ་ཐོབ་པ་དང་།
en: They are exceedingly brave, invincible, unexcelled, unafraid, fearless, intrepid, humble, unabashed, stable, and unwavering.

source: དབེན་པ་ལས་སྐྱེས་པ་དང་། དོན་གཅིག་པ་དང་། ཚུལ་གཅིག་པ་དང་། གཅིག་ཏུ་ཆད་པ་དང་། ཚུལ་གཅིག་ལ་ཞུགས་པ་དང་། གཅིག་ཏུ་ངེས་པར་བརྩོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་བསྒྲལ་བར་འདོད་པ་དང་། གཅིག་ཏུ་འདོད་པ་དང་། དེ་ཉིད་འདོད་པ་རྣམས་ནི་བྱང་ཆུབ་ཏུ་སྤྱོད་པར་བྱེད་དོ། །
en: They arise from detachment, with a single aim, a single principle, reduced to a single thing, remaining in a single principle, striving with a single conviction, wishing all beings to be free, with that single wish, that very wish.”

source: སྨྲས་པ།
en: Nārāyaṇa asked,

source: འཇམ་དཔལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་ལ་སྤྱོད་པ་ཡིན།
en: “Mañjuśrī, how does a bodhisattva carry out the bodhisattva practices?”

source: རིགས་ཀྱི་བུ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་དེ་ཟད་པའི་ཕྱིར་དང་། སྐྱེ་བའི་ཕྱིར་དང་། མི་ཟད་པའི་ཕྱིར་དང་། མི་སྐྱེ་བའི་ཕྱིར་མི་སྤྱོད་དེགཏན་དུ་ཟད་པ་དང་། ཟད་པ་མེད་པའི་ཕྱིར་རློམ་སེམས་སུ་མི་བྱེད་ལ། གཏན་དུ་མི་སྐྱེ་བ་ཡང་འཁྲུག་པར་མི་བྱེད་དེ། དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་ལ་སྤྱོད་པ་ཡིན་ནོ། །
en: “Son of noble family, whenever a bodhisattva no longer practices awakening to come to an end, to be born, not to come to an end, or not to be born, nor with the conceit of being perpetually at an end or unending, nor disturbed at being perpetually unborn, then a bodhisattva who so practices is carrying out the bodhisattva practices.

source: སྲེད་མེད་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདས་པའི་སེམས་ཟད་དོ། །ཞེས་སྤྱོད་པར་མི་བྱེད།
en: “In addition, Nārāyaṇa, a bodhisattva tells himself that the mind of the past has ended, and does not become involved;

source: མ་འོངས་པའི་སེམས་མ་ཕྱིན་ཏོ་ཞེས་སྤྱོད་པར་མི་བྱེད།
en: that the mind of the future, has not yet come, and does not become involved;

source: ད་ལྟར་བྱུང་བའི་སེམས་མི་གནས་སོ་ཞེས་སྤྱོད་པར་མི་བྱེད་ལ།
en: and that the mind of the present will not remain, and does not become involved.

source: འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སེམས་རྣམས་ལ་ཆགས་པར་མི་བྱེད་དེདེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་ལ་སྤྱོད་པ་ཡིན་ནོ། །
en: The bodhisattva great being who practices in this way—without getting attached to the mind of the past, future, or present—is carrying out the bodhisattva practices.

source: སྲེད་མེད་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ནི་སྦྱིན་པ་དང་། བྱང་ཆུབ་དང་། སེམས་ཅན་རྣམས་དང་། དེ་བཞིན་གཤེགས་པ་འདི་ལ་གཉིས་སུ་མེད་པར་སྤྱོད་དོ། །
en: “Moreover, Nārāyaṇa, bodhisattvas experience generosity and awakening, sentient beings and thus-gone ones, all in a nondualistic way.

source: ཚུལ་ཁྲིམས་དང་། བྱང་ཆུབ་དང་། སེམས་ཅན་རྣམས་དང་། དེ་བཞིན་གཤེགས་པ་འདི་ལ་གཉིས་སུ་མེད་པར་སྤྱོད་དོ། །
en: They experience discipline and awakening, sentient beings and thus-gone ones, all in a nondualistic way.

source: བཟོད་པ་དང་། བྱང་ཆུབ་དང་། སེམས་ཅན་རྣམས་དང་། དེ་བཞིན་གཤེགས་པ་འདི་ལ་གཉིས་སུ་མེད་པར་སྤྱོད་དོ། །
en: They experience patience and awakening, sentient beings and thus-gone ones, all in a nondualistic way.

source: བརྩོན་འགྲུས་དང་། བྱང་ཆུབ་དང་། སེམས་ཅན་རྣམས་དང་། དེ་བཞིན་གཤེགས་པ་འདི་ལ་གཉིས་སུ་མེད་པར་སྤྱོད་དོ། །
en: They experience diligence and awakening, sentient beings and thus-gone ones, all in a nondualistic way.

source: བསམ་གཏན་དང་། བྱང་ཆུབ་དང་། སེམས་ཅན་རྣམས་དང་། དེ་བཞིན་གཤེགས་པ་འདི་ལ་གཉིས་སུ་མེད་པར་སྤྱོད་དོ། །
en: They experience concentration and awakening, sentient beings and thus-gone ones, all in a nondualistic way.

source: ཤེས་རབ་དང་། བྱང་ཆུབ་དང་། སེམས་ཅན་རྣམས་དང་། དེ་བཞིན་གཤེགས་པ་འདི་ལ་གཉིས་སུ་མེད་པར་སྤྱོད་དོ། །
en: They experience insight and awakening, sentient beings and thus-gone ones, all in a nondualistic way.

source: གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དེ་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ལ་སྤྱོད་ལ། སྤྱོད་པའི་མཚན་ཉིད་དང་། ངོ་བོ་ཉིད་ཀྱང་འཁྲུག་པར་མི་བྱེད་ན་དེ་ཙམ་གྱིས་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་ལ་སྤྱོད་པ་ཞེས་བྱའོ། །
en: Whenever bodhisattvas practice the perfections in this way, it is said that simply by virtue of the fact that they are not in conflict with the characteristics or essence of the practice, those bodhisattvas are carrying out the practices of awakening.

source: སྲེད་མེད་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གཟུགས་སྟོང་ཞེས་མི་སྤྱོད་དེ།
en: “Furthermore, Nārāyaṇa, bodhisattvas do not tell themselves that forms are empty.

source: གཟུགས་ཉིད་སྟོང་པ་དང་། དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་སྟོང་ཞེས་མི་སྤྱོད་དེ།
en: Forms are empty by themselves. In the same way, they do not tell themselves that feelings, perceptions, formations, or consciousness are empty.

source: རྣམ་པར་ཤེས་པ་ཉིད་སྟོང་པའོ། །
en: Consciousness is empty by itself.

source: གཟུགས་ནི་སྟོང་པ་ཉིད་ཀྱིས་ཟད་པར་མི་བྱེད་དེ།
en: Form is not brought to an end by emptiness;

source: གཟུགས་ནི་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་གཏན་དུ་ཟད་པ་ཁོ་ནའོ། །
en: it is simply that form, since its very nature is emptiness, has always been at an end.

source: དེ་བཞིན་དུ་སྟོང་པ་ཉིད་ཀྱིས་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ཟད་པར་མི་བྱེད་དེ།
en: Likewise feelings, perceptions, formations, and consciousness are not brought to an end by emptiness;

source: སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་རྣམ་པར་ཤེས་པ་གཏན་དུ་ཟད་པ་ཁོ་ནའོ། །
en: it is simply that consciousness, since its very nature is emptiness, has always been at an end.

source: ཆོས་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་ཀྱིས་ཟད་པ་ཁོ་ནས་ཟད་པ་ཡིན་ཏེ།
en: All phenomena are at an end simply because they are at an end by their very nature;

source: གཟུགས་ཟད་པས་ཆོས་ཐམས་ཅད་ཟད་པ་མ་ཡིན་ནོ། །
en: it is not because form is at an end that all phenomena are at an end.

source: ཚོར་བ་ཟད་པ་དང་། འདུ་ཤེས་ཟད་པ་དང་། འདུ་བྱེད་རྣམས་ཟད་པ་དང་། རྣམ་པར་ཤེས་པ་ཟད་པས་ཆོས་ཐམས་ཅད་ཟད་པ་མ་ཡིན་ཏེ།
en: Nor is it because feelings are at an end, or because perceptions are at an end, or because formations are at an end, or because consciousness is at an end, that all phenomena are at an end.

source: དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་ལ་སྤྱོད་པ་ཡིན་ནོ། །
en: The bodhisattvas who practice in this way are carrying out the bodhisattva practices.

source: སྲེད་མེད་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ནི་སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་སྤང་བའི་ཕྱིར་ཡང་འབད་པར་མི་བྱེད་ལ། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་བསྐྱེད་པའི་ཕྱིར་ཡང་སྤྱོད་པར་མི་བྱེད་དོ། །
en: “In addition, Nārāyaṇa, bodhisattvas do not try to get rid of the traits of ordinary beings, nor do they practice in order to give rise to the qualities of buddhahood.

source: འཁོར་བ་ལས་ཡང་དག་པར་འདའ་བའི་ཕྱིར་དང་། མྱ་ངན་ལས་འདས་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་སྤྱོད་པར་མི་བྱེད་དོ། །
en: They do not practice in order to go beyond cyclic existence, nor in order to perfect the state of transcendence of suffering.

source: མི་དགེ་བའི་ཆོས་ཡོངས་སུ་འགྲུབ་པར་ཡང་མི་མཐོང་ལ། དགེ་བའི་ཆོས་ཡང་དག་པར་འགྲུབ་པ་ཡང་མི་མཐོང་ངོ་། །
en: They do not see unwholesome qualities as fully established, yet neither do they see wholesome qualities as truly established.

source: ཤེས་བྱ་ལ་མ་གཏོགས་པར་ཤེས་པ་ཡང་ཡང་དག་པར་མི་མཐོང་སྟེ།
en: They do not truly see any knowing apart from what is known.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་ཀྱི་དབྱིངས་དབྱེར་མེད་པར་སྤྱོད་པ་ལ་མོས་པ་ཡིན་ཏེ།
en: Bodhisattvas are those who, inseparably from the realm of phenomena, are disposed to the practice.

source: སྲེད་མེད་ཀྱི་བུ་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་ལ་སྤྱོད་པ་ཡིན་ནོ། །
en: Nārāyaṇa, bodhisattvas who practice in this way are carrying out the bodhisattva practices.

source: སྲེད་མེད་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་གྱི་ཁམས་ཚད་མེད་པ་དང་། ཆོས་ཀྱི་དབྱིངས་ཚད་མེད་པར་ཡང་མོས་ལ།
en: “Furthermore, Nārāyaṇa, bodhisattvas determine that the realm of sentient beings is limitless, as is the realm of phenomena. Yet

source: སེམས་ཅན་གྱི་ཁམས་ཀྱང་ཟད་པར་མི་བྱེད་ཅིང་ཆུད་གཟན་པའི་ཕྱིར་ཡང་སྤྱོད་པར་མི་བྱེད་དོ། །
en: they do not practice in order to bring the realm of sentient beings to an end and eliminate it.

source: སེམས་ཅན་གྱི་ཁམས་དང་། ཆོས་ཀྱི་དབྱིངས་དེ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་དབྱེར་མེད་ཅིང་མཚན་ཉིད་མེད་པའི་ཕྱིར་རོ། །
en: Because the realm of sentient beings and the realm of phenomena are not two things and they cannot be separated, because they are devoid of characteristics.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱང་འཕེལ་བ་ཡང་མེད། ཡོངས་སུ་འགྲིབ་པ་ཡང་མེད་ལ།
en: The realm of phenomena neither increases nor decreases, and

source: སེམས་ཅན་གྱི་ཁམས་ཀྱང་འཕེལ་བ་ཡང་མེད། ཡོངས་སུ་འགྲིབ་པ་ཡང་མེད་དོ། །
en: nor does the realm of sentient beings either increase or decrease.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་མཚན་ཉིད་གང་ཡིན་པ་དེ་ནི་སེམས་ཅན་གྱིས་ཁམས་ཀྱི་མཚན་ཉིད་ཀྱང་དེ་ཉིད་ཡིན་ནོ། །
en: All characteristics of the realm of phenomena are also the characteristics of the realms of sentient beings.

source: སྲེད་མེད་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཐམས་ཅད་མཚན་ཉིད་མེད་པར་ཤེས་ནས། ཆོས་ཀྱི་དབྱིངས་དང་། སེམས་ཅན་གྱི་ཁམས་ཟད་པའི་ཕྱིར་ཡང་མི་སྤྱོད།
en: “Moreover, Nārāyaṇa, because bodhisattvas know that all phenomena lack characteristics, they do not practice in order to put an end to the realm of phenomena and the realm of sentient beings,

source: འཕེལ་བའི་ཕྱིར་ཡང་མི་སྤྱོད་དོ། །
en: nor do they practice in order to increase them.

source: འདི་ལ་ཡང་དག་པ་མ་ཡིན་པར་ཡོངས་སུ་བརྟགས་པ་ལས་བྱུང་བ་དང་། ཕྱིན་ཅི་ལོག་ལས་བྱུང་བ་དང་། རྣམ་པར་བསྒྲུབས་པས་ཉེ་བར་གནས་པའི་ཉོན་མོངས་པ་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱིར་སྤྱོད་ཀྱི།
en: They practice in order to know how the afflictions come about within them due to mistaken imputation, how they come about due to error, and how they remain once they have manifested.

source: འཁོར་བའི་གནོད་པ་གཞིག་པའི་ཕྱིར་དང་། བདག་དང་། སེམས་ཅན་དང་། སྲོག་དང་། གང་ཟག་གཞིག་པའི་ཕྱིར་སྤྱོད་པར་མི་བྱེད་དེ
en: They do not practice in order to destroy the harms in cyclic existence, nor to destroy the self, sentient beings, living beings, or individuals.

source: སྲེད་མེད་ཀྱི་བུ་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་ལ་སྤྱོད་པ་ཡིན་ནོ།། །།
en: Nārāyaṇa, bodhisattvas who practice in this way are carrying out the bodhisattva practices.”

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་སྤྱོད་པའི་ལེའུའི་ཆོས་བསྟན་པ་འདི་བཤད་པ་ན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་ཞུགས་པའི་ལྷའི་བུ་བཅུ་དྲུག་གིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །
en: When Mañjuśrī­kumāra­bhūta bestowed this Dharma teaching, the discourse on practice, sixteen gods who were genuinely immersed in the Great Vehicle achieved acceptance that phenomena are unborn.

source: དེ་ནས་ཚན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མཆོད་པའི་ལས་བྱ་བ་དང་། ཡོངས་སུ་གཟུང་བའི་ཕྱིར་
en: Then the mighty strongman Vimalatejā, in order to make reverence to this Dharma discourse and to uphold it, made the solemn promise,

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མོས་པའི་སེམས་ཅན་གང་དག་ལགས་པ་དེ་དག་གི་དོན་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་ལགས་སོ་ཞེས་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་དོ། །
en: “Blessed One, I will assist those beings who are devoted to this Dharma discourse to accomplish all their goals.”

source: དེ་ནས་ལྷའི་བུ་བདུད་བྲལ་གྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Finally the god named Free of Demons addressed Mañjuśrī­kumāra­bhūta,

source: འཇམ་དཔལ་བདག་གིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཇི་ལྟར་སྤྱོད་ན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ལ་སྤོབས་སོ། །
en: “Mañjuśrī, I, too, have been inspired to speak about the way in which bodhisattva great beings carry out the bodhisattva practices.”

source: ལྷའི་བུ་ཁྱོད་ཀྱིས་དེའི་དུས་ལ་དབབ་པར་ཤེས་ན་སྤོབས་པར་གྱིས་ཤིག །
en: “God, if you know it is the right time, then express your inspiration.”

source: ལྷའི་བུས་སྨྲས་པ།
en: The god then proceeded,

source: འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ལ་སྤྱོད་པ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའོ། །
en: “Mañjuśrī, any practice related to any phenomenon constitutes bodhisattva practice.

source: བདུད་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའོ། །
en: Any practice related to any demon constitutes bodhisattva practice.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའོ། །
en: Any practice of any being constitutes bodhisattva practice.

source: སློབ་པ་དང་མི་སློབ་པ་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའོ། །
en: Any practice related to training or nontraining constitutes bodhisattva practice.

source: རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའོ། །
en: Any practice of any solitary buddha constitutes bodhisattva practice.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའོ། །
en: Any practice of any buddha constitutes bodhisattva practice.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཐམས་ཅད་ལ་བསླབ་དགོས་པའི་ཕྱིར་རོ། །
en: Because bodhisattva great beings must train in everything.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྲེད་མེད་ཀྱི་བུས་ལྷའི་བུ་བདུད་བྲལ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Bodhisattva Nārāyaṇa asked the god Free of Demons,

source: ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་འདི་ལ་ཇི་ལྟར་སྤྱད་པར་བྱ།
en: “God, how do bodhisattva great beings carry out this type of practice of everything?”

source: སྲེད་མེད་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི་སེམས་ཅན་གྱི་སྤྱོད་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་ལ་བསླབ་པར་བྱ་སྟེ།
en: “Nārāyaṇa, bodhisattva great beings should train in all the 84,000 kinds of conduct of sentient beings.

source: འདོད་ཆགས་སྤྱོད་པ་རྣམས་ཀྱི་ཉི་ཁྲི་ཆིག་སྟོང་དང་།
en: These consist of the 21,000 kinds of conduct related to attachment,

source: ཞེ་སྡང་སྤྱོད་པ་རྣམས་ཀྱི་ཉི་ཁྲི་ཆིག་སྟོང་དང་།
en: the 21,000 kinds of conduct related to anger,

source: གཏི་མུག་སྤྱོད་པ་རྣམས་ཀྱི་ཉི་ཁྲི་ཆིག་སྟོང་དང་།
en: the 21,000 kinds of conduct related to delusion, and

source: ཆ་མཉམ་པར་སྤྱོད་པ་རྣམས་ཀྱི་ཉི་ཁྲི་ཆིག་སྟོང་ངོ་། །
en: the 21,000 kinds of conduct in which all three come together.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་དེ་ལ་ཡང་འཇུག་པར་བྱ་སྟེ།
en: Bodhisattva great beings should engage in all of these kinds of conduct of sentient beings.

source: དེས་འདོད་ཆགས་སྤྱོད་པ་ལ་སྤྱད་པར་བྱ་ཞིང་འདོད་ཆགས་དང་བྲལ་བར་ཡང་བྱའོ། །
en: They should engage in conduct related to attachment, and be free of attachment.

source: ཞེ་སྡང་སྤྱོད་པ་ལ་སྤྱད་པར་བྱ་ཞིང་། ཞེ་སྡང་དང་བྲལ་བར་ཡང་བྱའོ། །
en: They should engage in conduct related to anger, and be free of anger.

source: གཏི་མུག་སྤྱོད་པ་ལ་སྤྱད་པར་བྱ་ཞིང་གཏི་མུག་དང་བྲལ་བར་ཡང་བྱའོ། །
en: They should engage in conduct related to delusion, and be free of delusion.

source: ཉེས་པ་ཐམས་ཅད་སྤྱོད་པ་ལ་སྤྱད་པར་བྱ་ཞིང་། ཉེས་པ་ཐམས་ཅད་དང་བྲལ་བར་ཡང་བྱའོ། །
en: They should engage in conduct related to every type of fault, and be free of every type of fault.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་སྤྱད་པ་ཐམས་ཅད་ལ་ཡང་སྤྱོད་ལ། སྤྱོད་པ་ཐམས་ཅད་ཀྱིས་ཀྱང་མི་གོས་པ་དང་།
en: While bodhisattvas engage in every type of conduct, they should not be tainted by that conduct.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྤྱོད་པ་ཐམས་ཅད་ཀྱང་འགྲུབ་པར་སྣང་བའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ཡིན་ནོ། །
en: In order to bring beings to maturity, bodhisattvas appear to be carrying out all types of conduct—this is bodhisattva practice.”

source: ལྷའི་བུ་ཇི་ལྟར་ན་བདུད་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་གང་ཡིན་པ་དེ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡིན།
en: “God, how is it that any practice related to any demon constitutes bodhisattva practice?”

source: བྱང་ཆུབ་སེམས་དཔས་ནི་སེམས་ཀྱི་འཇུག་པ་རྣམས་ལས་བདུད་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་བལྟ་བར་བྱ་སྟེ།
en: “Bodhisattvas should view all kinds of demonic conduct within the mental processes, yet

source: བདུད་ཀྱི་ལས་བྱུང་ངོ་ཅོག་གི་དབང་དུ་ཡང་འགྲོ་བར་མི་བྱའོ། །
en: they should avoid becoming caught up in any of the workings of demons.

source: བདུད་ཀྱི་ལས་ཀྱི་ཉིང་མཚམས་སྦྱོར་བར་ཡང་མི་བྱའོ། །
en: They should not initiate the workings of demons.

source: སྤྱོད་པ་ཐམས་ཅད་ལ་འཇུག་པ་ལ་ཡང་སྦྱོར་བར་བྱའོ། །
en: They should apply this engaging in all types of conduct.

source: བདུད་གཅིག་ཏུ་ངེས་པར་ཡང་བསྟན་པར་བྱ་སྟེ།
en: They should demonstrate conviction in demons alone, yet

source: དེའི་དབང་དུ་འགྲོ་བར་ཡང་མི་བྱའོ། །
en: they should not fall under their power.

source: དེས་བདུད་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་ཡང་བསླབ་པར་བྱ་སྟེ།
en: They should learn the ripening of demons, yet

source: བདུད་ཀྱི་ལས་དང་འབྲལ་བར་ཡང་བྱའོ། །
en: be free of the workings of demons.”

source: ལྷའི་བུ་ཇི་ལྟར་ན་སློབ་པ་དང་། མི་སློབ་པ་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་གང་ཡིན་པ་དེ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡིན།
en: “God, how is it that any practice related to training, to nontraining, or to any solitary buddha constitutes bodhisattva practice?”

source: རིགས་ཀྱི་བུ་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སྤྱོད་པ་ཐམས་ཅད་ངོ་བོ་ཉིད་མེད་པའི་སྤྱོད་པ་དང་། རྣམ་པར་སྨིན་པ་མེད་པའི་སྤྱོད་པ་དང་། གནས་པ་མེད་པའི་སྤྱོད་པ་དང་། འཕོ་བ་མེད་པའི་སྤྱོད་པ་དང་། སྐྱེ་བ་མེད་པའི་སྤྱོད་པ་ལ་མོས་པ་རྣམས་ལ་སྦྱོར་བར་བྱའོ། །
en: “Son of noble family, it is in this way that bodhisattvas connect to those who have interest in the practice that is the lack of essential nature of all practices, the practice that has no ripening, the practice that has no dwelling, the practice that has no transference, the practice that has no birth.”

source: དེ་ནས་ལྷའི་བུ་བདུད་བྲལ་གྱིས་བསྟན་པ་འདི་བཤད་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Having spoken this teaching, the god Free of Demons said to Mañjuśrī­kumāra­bhūta,

source: འཇམ་དཔལ་བདག་གི་སྤོབས་པ་ནི་དེ་ཙམ་དུ་བས་ཀྱིས།
en: “Mañjuśrī, this is the extent of my inspiration.

source: སྤྱོད་པ་བཤད་པ་འདི་ལས་བརྩམས་ཏེ་རྒྱས་པར་ཁྱོད་སྤོབས་པར་མཛོད་ཅིག །
en: Starting with what I have said about practice, please expand on it, and express it in your own way.”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ལྷའི་བུ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Mañjuśrī­kumāra­bhūta, in answer to the god’s request, said,

source: ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ནི་ཡུལ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ་ཡིན་ནོ། །
en: “God, bodhisattva practice entirely transcends all domains.

source: སྤྱོད་པ་དེ་ནི་མིག་དང་གཟུགས་ཀྱི་ཡུལ་དུ་བགྲང་བ་མ་ཡིན་ནོ། །
en: Such practice cannot be considered within the domain of the eyes and visual form.

source: རྣ་བ་དང་། སྒྲ་དང་། སྣ་དང་། དྲི་དང་། ལྕེ་དང་། རོ་དང་། ལུས་དང་། རེག་བྱ་དང་། ཡིད་དང་ཆོས་ཀྱི་ཡུལ་དུ་བགྲང་བ་མ་ཡིན་ཏེ
en: Likewise it cannot be considered within the domain of the ears and sound, the nose and scent, the tongue and taste, the body and touch, or that of the mind and mental objects.

source: ལྷའི་བུ་རྣམ་གྲངས་དེས་ཀྱང་ཁྱོད་ཀྱིས་ཅི་ནས་སྐྱེས་བུ་དམ་པ་དེ་དག་གི་སྤྱོད་ཡུལ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ་ཡིན་པར་དེ་ལྟར་རིག་པར་བྱའོ། །
en: God, you should understand from this description how sublime beings’ experience entirely transcends all these domains.

source: ལྷའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སྤྱོད་པ་གང་ལ་སྤྱོད་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མི་མཉེས་པར་མི་བྱེད་པ་
en: Moreover, god, no matter what practices bodhisattvas are involved in, they never displease the blessed buddhas.

source: དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་ལ་སྤྱོད་པ་ཡིན་ནོ། །
en: Bodhisattvas who act in this way are carrying out bodhisattva practice.”

source: འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔས་ཇི་ལྟར་སྤྱད་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མཉེས་པར་བགྱིད།
en: “Mañjuśrī, what do bodhisattvas do to please the blessed buddhas?”

source: ལྷའི་བུ་དེ་བཞིན་གཤེགས་པས་ནི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་སྟོང་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: “God, the thus-gone ones have fully and perfectly awakened to the true emptiness of all things.

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ལྟ་བ་འགའ་ཞིག་ལ་མངོན་པར་ཞེན་ཏེ། ཐ་ན་སངས་རྒྱས་ཀྱི་ཆོས་དང་། མྱ་ངན་ལས་འདས་པའི་ལྟ་བ་ལ་མངོན་པར་ཞེན་ན་ཡང་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྐུ་སླུ་བ་ཡིན་ནོ། །
en: So if bodhisattvas become fixated on some viewpoint, even if it is the Buddha’s teachings, or the view of the transcendence of suffering, they disappoint the thus-gone ones.

source: ལྷའི་བུ་དེ་བཞིན་གཤེགས་པས་ནི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་མཚན་མ་མེད་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: God, the thus-gone ones have fully and perfectly awakened to the true signlessness of all things.

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འགའ་ཞིག་མཚན་མར་བྱེད་དམ། མཚན་མ་དང་འགྲོགས་པར་བྱེད་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སྐུ་སླུ་བ་ཡིན་ནོ། །
en: So if bodhisattvas characterize something, or habituate themselves to characteristics, they disappoint the thus-gone ones.

source: དེ་བཞིན་གཤེགས་པས་ནི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་སྨོན་པ་མེད་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: “The thus-gone ones have fully and perfectly awakened to the true wishlessness regarding all things.
